tutorials/old/CYCLIC/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  "(rho|rhoU|rhoE)"
    {
      solver diagonal;
    }

  //p
  //{}

    U
    {
      solver smoothSolver;
      smoother  GaussSeidel;
      nSweeps  2;
      tolerance   1e-09;
      reTol   0.01;
    }

    h
    {
      $U;
      tolerance   1e-10;
      reTol   0;
    }
    
    //T
    //{}
}

fieldBounds
{
    rho 0.001 10000;
    p   0.001 1e7;
    T   0.001 10000;
}


// ************************************************************************* //
